import React from 'react';

const About = () => {
  return (
    <div className='about'>
      <h1>אודות TimeTunnel</h1>
      <p>
      כחובבת הסטוריה מושבעת, מיד עלה ברעיוני לבחור בפרויקט שיהווה מנוף לידע היסטורי. ידע היסטורי טומן בחובו עולם שלם של מושגים ותוכן, שלא פעם אינם נגישים מספיק עבור אלו שמעונינים לחקור ולדעת נתונים מדויקים על אירועים היסטוריים מהעבר.
יש אומנם אתרי תוכן רבים, כמו ויקיפדיה ועוד, אך ככל שחקרתי לא מצאתי אף אתר שמשמש עבור תקשורת ושיחה על נושאים היסטוריים.
לשם כך החלטתי להרים את הכפפה ולהקים אתר שמשרת את המטרות האלו, אתר שיהווה פלטפורמה עבור ידע הסטורי, שיתוף מידע מהימן וחקירה של אירועים אלו.

      </p>
    
    </div>
  );
}

export default About;
