import React from 'react';

const TermsConditions = () => {
    return (
        <div className="terms-container">
            <h1>תנאי שימוש ותנאים</h1>
            <div className="terms-content">
                <h2>1. מידע כללי</h2>
                <p>
                    1.1 האתר מספק שירות בו משתמשים יכולים לבחור אירוע ולקבוע פגישה באורך של 45 דקות עם מומחה בתחום ההיסטוריה על מנת לקבל מידע נוסף על האירוע.
                </p>
                <p>
                    1.2 לאחר הפגישה, המשתמש חייב להעביר את סכום התשלום של 100$ למומחה בהיסטוריה.
                </p>
                <p>
                    1.3 יתרה לפני הפגישה חייבת להיות בסך 100$ גם היא, ואין אפשרות להחזיר את הסכום אם הפגישה בוטלה על ידי המשתמש. במקרה שהמומחה מבטל, המשתמש יקבל את הסכום הנכון לו.
                </p>
                <p>
                    1.4 אנו איננו אחראים לכספים ולאבטחתם. אנו מבטיחים רק כי המומחים הם אנשי חיוב ומקצועיים.
                </p>
                <h2>2. הגבלת אחריות</h2>
                <p>
                    2.1 אנו איננו אחראים לנזקים או להפסדים שייגרמו עקב שימוש בשירותים שלנו.
                </p>
                <p>
                    2.2 השימוש בשירותים שלנו הינו על אחריות המשתמש בלבד.
                </p>
                <h2>3. שינויים לתנאים</h2>
                <p>
                    3.1 החברה רשאית לשנות את תנאי השימוש בכל עת לפי שיקול דעתה הבלעדי.
                </p>
                <p>
                    3.2 שינויים לתנאי השימוש ייכנסו לתוקפם לאחר פרסומם באתר.
                </p>
                <h2>4. תוקף</h2>
                <p>
                    4.1 תנאי השימוש והתנאים תקפים מיום פרסומם באתר ועד לכל עת שיהיה להם תוקף.
                </p>
            </div>
        </div>
    );
}

export default TermsConditions;
